{"keras_version": "2.0.5", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "trainable": true, "dtype": "float32", "name": "conv2d_1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 200, 200, 3], "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "linear", "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_5"}}], "backend": "tensorflow", "class_name": "Sequential"}